cask_args appdir: "/Applications"

tap "universal-ctags/universal-ctags"
tap "homebrew/cask-drivers"

brew "coreutils"
brew "deno"
brew "ffmpeg"
brew "fish"
brew "git"
brew "gnu-sed"
brew "mas"
brew "ripgrep"
brew "tmux"
brew "universal-ctags", args: ["HEAD"]
brew "w3m"
brew "wget"

cask "alfred"
cask "appcleaner"
cask "arc"
cask "bettertouchtool"
cask "box-sync"
cask "brave-browser"
cask "clipy"
cask "coconutbattery"
cask "dropbox"
cask "fork"
cask "garmin-express"
cask "gimp"
cask "google-chrome"
cask "google-earth-pro"
cask "google-japanese-ime"
cask "handbrake"
cask "ibettercharge"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "keyclu"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "macdown"
cask "macvim"
cask "notion"
cask "onyx"
cask "p4v"
cask "skitch"
cask "skype"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
#cask "virtualbox"
cask "vlc"

mas "Spark", id: 1176895641
mas "Amphetamine", id: 937984704
